app/views/clients/history.html.erb

				<tr>
					<% @reserva = Reservation.find(relation['id'])%>
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]