app/views/clients/mostrar.html.erb

		<div class="toast-body">
			<% @reserva = Reservation.find(meeting['id'])%>
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]