app/views/reservations/pick_date.html.erb

SELECT "reservations"."block_id" FROM "reservations" WHERE (date = '2019-07-01' AND doctor_id = 2)
SELECT "blocks".* FROM "blocks" WHERE (id NOT IN (200))
---
  <% if date > Date.today && date.strftime("%A").downcase != "sunday" && date.strftime("%A").downcase != "saturday" %>
    <% @reservation_bll = Reservation.where("date = ? AND doctor_id = ?", date.to_date, @doctor.id).pluck(:block_id) + [200] %>
    <% @blocks = Block.where("id NOT IN (?)", @reservation_bll)%>