app/views/doctors/history.html.erb

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
				<tr>
					<% @reserva = Reservation.find(relation['id'])%>