app/controllers/blocks_controller.rb

  def index
    @blocks = Block.all
---
SELECT "blocks".* FROM "blocks"

  def create
    @block = Block.new(block_params)

    if @block.save
---
INSERT INTO "blocks" ("created_at", "updated_at", "date", "description") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-05-14 14:58:24.900288"], ["updated_at", "2019-05-14 14:58:24.900288"], ["date", "2019-12-17 00:00:00"], ["description", "Buema"]]

    def set_block
      @block = Block.find(params[:id])
---
SELECT  "blocks".* FROM "blocks" WHERE "blocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]