app/controllers/clients_controller.rb

	def mostrar
		@user = current_client
		@reservations = Reservation.where("client_id = #{@user.id}")
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def history
		@user = current_client
		@reservations = Reservation.where("client_id = #{@user.id}")
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]