app/controllers/doctors_controller.rb

	def history
		@user = current_doctor
		@reservations = Reservation.where("doctor_id = #{@user.id}")
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]