app/controllers/reservations_controller.rb

SELECT "doctors".* FROM "doctors" ORDER BY "doctors"."first_name" ASC
---
  def index
    @reservations = Reservation.all
    @doctors = Doctor.order(first_name: :asc)

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def pick_date
    @doctor = Doctor.find(params[:doctor])

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def go_new
    @doctor = Doctor.find(params[:doctor])

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 ORDER BY "doctors"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 ORDER BY "clients"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "blocks".* FROM "blocks" WHERE "blocks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @reservation = Reservation.find(params[:id])

    # Calcular la fecha mas bonito
    @date = @reservation.date.to_s
    @dia = @date[-2,2]
    @mes = Date::MONTHNAMES[@date[-5, 2].to_i]
    @mes = helpers.get_month_spanish @mes
    @año = @date[0, 4]
    @fecha = "#{@dia} de #{@mes} de #{@año}"

    @doctor = Doctor.find(@reservation.doctor_id)
    @client = Client.find(@reservation.client_id)
    @block = Block.find(@reservation.block_id)

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reservations"."block_id" FROM "reservations" WHERE (date = '2019-06-07' AND doctor_id = 1)
SELECT  "blocks".* FROM "blocks" WHERE "blocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @reservation = Reservation.new
    @client = current_client
    @date = params[:date]
    @doctor = Doctor.find(params[:doctor])
    @reservation_bll = Reservation.where("date = ? AND doctor_id = ?", @date.to_date, @doctor.id).pluck(:block_id) + [200]
    @blocks = Block.where("id NOT IN (?)", @reservation_bll)

SELECT  "blocks".* FROM "blocks" WHERE "blocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "reservations".* FROM "reservations" WHERE (doctor_id = 1) AND (date = '2019-07-04') ORDER BY "reservations"."block_id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "doctors".* FROM "doctors"
INSERT INTO "reservations" ("created_at", "updated_at", "client_id", "block_id", "doctor_id", "date") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2019-05-29 20:46:06.700535"], ["updated_at", "2019-05-29 20:46:06.700535"], ["client_id", 2], ["block_id", 5], ["doctor_id", 1], ["date", "2019-06-07"]]
---
  def create
    @reservation = Reservation.new
    @reservation.doctor_id = params['reservation']['doctor_id']
    @block = Block.find(params['reservation']['block_id'])
    @date = params['reservation']['date']
    @client = current_client
    @reservation.client_id = @client.id
    @reservation.block_id = @block.id
    @reservation.date = @date
    @doctors = Doctor.all
    if @reservation.save

DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 1]]
---
  def destroy
    @reservation.destroy