app/controllers/treatments_controller.rb

SELECT "treatments"."doctor_id" FROM "treatments" WHERE (client_id = 3)
SELECT "doctors".* FROM "doctors" WHERE (id IN (NULL))
---
  def showclient
    @client = current_client
    @treatmentscomments_ids = Treatment.where('client_id = ?', @client).pluck(:doctor_id)
    @doctorscomments = Doctor.where('id IN (?)', @treatmentscomments_ids)